In [83]:
import pandas as pd
import numpy as np
import seaborn as sns
import statsmodels.formula.api as smf
import sklearn.metrics
from sklearn.metrics import confusion_matrix, accuracy_score
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt
%matplotlib inline

In [84]:
# conda install -c conda-forge imbalanced-learn

In [85]:
df=pd.read_csv('~/Downloads/home-credit-default-risk/application_train.csv')

In [86]:
df['age']= (df['DAYS_BIRTH']/-365).round(0)

In [87]:
df.columns.tolist()

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'AMT_GOODS_PRICE',
 'NAME_TYPE_SUITE',
 'NAME_INCOME_TYPE',
 'NAME_EDUCATION_TYPE',
 'NAME_FAMILY_STATUS',
 'NAME_HOUSING_TYPE',
 'REGION_POPULATION_RELATIVE',
 'DAYS_BIRTH',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH',
 'OWN_CAR_AGE',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'OCCUPATION_TYPE',
 'CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'EXT_SOURCE_1',
 'EXT_SOURCE_2',
 'EXT_SOURCE_3',
 'APARTMENTS_AVG',
 'BASEMENTAREA_AVG',
 'YEARS_BEGINEXPLUATATION_AVG',
 'YEARS_BUILD_AVG',
 'COMMONAREA_AVG',
 'ELEVATORS_AVG',
 'ENTRANCES_AVG',
 'FLOORSMAX_AVG',
 'FLOORSMIN_AVG',
 'LANDAREA_AVG',
 'LIVINGAPARTMENTS_AVG',
 'LIVINGAREA_AVG',
 'NONLIVINGAPARTMENTS_AVG',
 'NONLIVINGAREA_AVG',
 'APARTMENTS_MODE',
 'BASEMENTAREA_MODE',
 'YEARS_BEGINEXPLUATATION_MODE',
 'YEARS_BUILD_MODE',
 'COMMONAREA_MODE',
 'ELEVATORS_MODE',
 'ENTRANCES_MODE',
 'FLOORSMAX_MODE',
 'FLOORSMIN_MODE',
 'LANDAREA_MODE',
 'LIVINGAPARTMENTS_MODE',
 'LIVINGAREA_MODE',
 'NONLIVINGAPARTMENTS_MODE',
 'NONLIVINGAREA_MODE',
 'APARTMENTS_MEDI',
 'BASEMENTAREA_MEDI',
 'YEARS_BEGINEXPLUATATION_MEDI',
 'YEARS_BUILD_MEDI',
 'COMMONAREA_MEDI',
 'ELEVATORS_MEDI',
 'ENTRANCES_MEDI',
 'FLOORSMAX_MEDI',
 'FLOORSMIN_MEDI',
 'LANDAREA_MEDI',
 'LIVINGAPARTMENTS_MEDI',
 'LIVINGAREA_MEDI',
 'NONLIVINGAPARTMENTS_MEDI',
 'NONLIVINGAREA_MEDI',
 'FONDKAPREMONT_MODE',
 'HOUSETYPE_MODE',
 'TOTALAREA_MODE',
 'WALLSMATERIAL_MODE',
 'EMERGENCYSTATE_MODE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR',
 'age']

In [88]:
df.drop(['NAME_CONTRACT_TYPE','FLAG_OWN_REALTY',
 'CNT_CHILDREN','REGION_POPULATION_RELATIVE',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH','OWN_CAR_AGE',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL','CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'EXT_SOURCE_1',
 'EXT_SOURCE_2',
 'EXT_SOURCE_3',
 'APARTMENTS_AVG',
 'BASEMENTAREA_AVG',
 'YEARS_BEGINEXPLUATATION_AVG',
 'YEARS_BUILD_AVG',
 'COMMONAREA_AVG',
 'ELEVATORS_AVG',
 'ENTRANCES_AVG',
 'FLOORSMAX_AVG',
 'FLOORSMIN_AVG',
 'LANDAREA_AVG',
 'LIVINGAPARTMENTS_AVG',
 'LIVINGAREA_AVG',
 'NONLIVINGAPARTMENTS_AVG',
 'NONLIVINGAREA_AVG',
 'APARTMENTS_MODE',
 'BASEMENTAREA_MODE',
 'YEARS_BEGINEXPLUATATION_MODE',
 'YEARS_BUILD_MODE',
 'COMMONAREA_MODE',
 'ELEVATORS_MODE',
 'ENTRANCES_MODE',
 'FLOORSMAX_MODE',
 'FLOORSMIN_MODE',
 'LANDAREA_MODE',
 'LIVINGAPARTMENTS_MODE',
 'LIVINGAREA_MODE',
 'NONLIVINGAPARTMENTS_MODE',
 'NONLIVINGAREA_MODE',
 'APARTMENTS_MEDI',
 'BASEMENTAREA_MEDI',
 'YEARS_BEGINEXPLUATATION_MEDI',
 'YEARS_BUILD_MEDI',
 'COMMONAREA_MEDI',
 'ELEVATORS_MEDI',
 'ENTRANCES_MEDI',
 'FLOORSMAX_MEDI',
 'FLOORSMIN_MEDI',
 'LANDAREA_MEDI',
 'LIVINGAPARTMENTS_MEDI',
 'LIVINGAREA_MEDI',
 'NONLIVINGAPARTMENTS_MEDI',
 'NONLIVINGAREA_MEDI',
 'FONDKAPREMONT_MODE',
 'HOUSETYPE_MODE',
 'TOTALAREA_MODE',
 'WALLSMATERIAL_MODE',
 'EMERGENCYSTATE_MODE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR','OCCUPATION_TYPE','NAME_FAMILY_STATUS','NAME_TYPE_SUITE','AMT_CREDIT','AMT_ANNUITY','AMT_GOODS_PRICE','DAYS_BIRTH'
        ], axis = 1, inplace=True)

In [89]:
df[df['CODE_GENDER']=='XNA']
df.drop(df.index[[35657,38566,83382,189640]],inplace=True)

In [90]:
from imblearn.over_sampling import SMOTE

In [91]:
df.head(15)

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
0,100002,1,M,N,202500.000,Working,Secondary / secondary special,House / apartment,26.0
1,100003,0,F,N,270000.000,State servant,Higher education,House / apartment,46.0
2,100004,0,M,Y,67500.000,Working,Secondary / secondary special,House / apartment,52.0
3,100006,0,F,N,135000.000,Working,Secondary / secondary special,House / apartment,52.0
4,100007,0,M,N,121500.000,Working,Secondary / secondary special,House / apartment,55.0
5,100008,0,M,N,99000.000,State servant,Secondary / secondary special,House / apartment,46.0
6,100009,0,F,Y,171000.000,Commercial associate,Higher education,House / apartment,38.0
7,100010,0,M,Y,360000.000,State servant,Higher education,House / apartment,52.0
8,100011,0,F,N,112500.000,Pensioner,Secondary / secondary special,House / apartment,55.0
9,100012,0,M,N,135000.000,Working,Secondary / secondary special,House / apartment,40.0
10,100014,0,F,N,112500.000,Working,Higher education,House / apartment,28.0
11,100015,0,F,N,38419.155,Pensioner,Secondary / secondary special,House / apartment,56.0
12,100016,0,F,N,67500.000,Working,Secondary / secondary special,House / apartment,37.0
13,100017,0,M,Y,225000.000,Working,Secondary / secondary special,House / apartment,39.0
14,100018,0,F,N,189000.000,Working,Secondary / secondary special,House / apartment,40.0

In [92]:
df.tail(50)

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
307461,456200,0,F,N,157500.0,Working,Higher education,House / apartment,35.0
307462,456201,0,F,Y,135000.0,Working,Secondary / secondary special,House / apartment,34.0
307463,456203,0,F,N,180000.0,Pensioner,Secondary / secondary special,House / apartment,66.0
307464,456204,0,F,N,58500.0,State servant,Secondary / secondary special,House / apartment,40.0
307465,456205,0,F,N,180000.0,Working,Secondary / secondary special,House / apartment,37.0
307466,456206,0,F,N,157500.0,State servant,Secondary / secondary special,House / apartment,47.0
307467,456207,0,F,N,247500.0,Working,Higher education,House / apartment,49.0
307468,456208,0,F,N,135000.0,Working,Higher education,House / apartment,27.0
307469,456209,0,F,N,202500.0,Pensioner,Secondary / secondary special,House / apartment,61.0
307470,456210,0,F,N,90000.0,Working,Secondary / secondary special,House / apartment,29.0
307471,456211,0,F,N,112500.0,Working,Secondary / secondary special,House / apartment,37.0
307472,456212,0,F,N,135000.0,Commercial associate,Higher education,House / apartment,49.0
307473,456213,0,F,Y,90000.0,Working,Secondary / secondary special,House / apartment,40.0
307474,456214,0,M,Y,135000.0,Commercial associate,Secondary / secondary special,With parents,48.0
307475,456215,1,F,N,144000.0,Working,Higher education,House / apartment,37.0
307476,456216,0,F,N,135000.0,Working,Higher education,House / apartment,38.0
307477,456217,0,F,N,360000.0,State servant,Higher education,House / apartment,51.0
307478,456218,0,F,N,225000.0,Commercial associate,Higher education,House / apartment,53.0
307479,456219,0,F,N,112500.0,Working,Secondary / secondary special,House / apartment,37.0
307480,456220,0,F,N,81000.0,State servant,Higher education,Rented apartment,29.0
307481,456225,1,M,N,225000.0,Working,Secondary / secondary special,House / apartment,57.0
307482,456226,0,F,Y,225000.0,Commercial associate,Secondary / secondary special,House / apartment,39.0
307483,456227,0,F,N,99000.0,Pensioner,Secondary / secondary special,House / apartment,68.0
307484,456228,0,F,Y,540000.0,Commercial associate,Secondary / secondary special,Rented apartment,35.0
307485,456229,0,F,N,270000.0,Working,Secondary / secondary special,With parents,33.0
307486,456230,0,F,Y,292500.0,Commercial associate,Higher education,House / apartment,44.0
307487,456231,0,M,N,117000.0,Pensioner,Secondary / secondary special,House / apartment,63.0
307488,456232,0,F,N,157500.0,State servant,Higher education,House / apartment,28.0
307489,456233,1,F,N,225000.0,Commercial associate,Secondary / secondary special,House / apartment,45.0
307490,456234,0,M,N,81000.0,Commercial associate,Higher education,House / apartment,27.0
307491,456235,0,M,Y,90000.0,Commercial associate,Secondary / secondary special,House / apartment,30.0
307492,456236,0,M,Y,585000.0,Working,Secondary / secondary special,House / apartment,57.0
307493,456237,0,F,N,135000.0,Working,Secondary / secondary special,House / apartment,48.0
307494,456238,0,M,Y,270000.0,Commercial associate,Secondary / secondary special,House / apartment,41.0
307495,456239,0,M,Y,180000.0,Working,Higher education,House / apartment,57.0
307496,456240,0,F,N,360000.0,Working,Higher education,House / apartment,48.0
307497,456241,0,F,Y,180000.0,Working,Secondary / secondary special,House / apartment,46.0
307498,456242,0,M,Y,198000.0,Commercial associate,Secondary / secondary special,House / apartment,52.0
307499,456243,0,F,N,81000.0,Commercial associate,Secondary / secondary special,House / apartment,47.0
307500,456244,0,F,N,261000.0,Working,Higher education,House / apartment,56.0
307501,456245,0,F,N,81000.0,Commercial associate,Secondary / secondary special,House / apartment,36.0
307502,456246,0,F,N,94500.0,Working,Secondary / secondary special,House / apartment,44.0
307503,456247,0,F,N,112500.0,Commercial associate,Higher education,House / apartment,33.0
307504,456248,0,F,N,153000.0,Working,Secondary / secondary special,House / apartment,46.0
307505,456249,0,F,N,112500.0,Pensioner,Secondary / secondary special,House / apartment,67.0
307506,456251,0,M,N,157500.0,Working,Secondary / secondary special,With parents,26.0
307507,456252,0,F,N,72000.0,Pensioner,Secondary / secondary special,House / apartment,57.0
307508,456253,0,F,N,153000.0,Working,Higher education,House / apartment,41.0
307509,456254,1,F,N,171000.0,Commercial associate,Secondary / secondary special,House / apartment,33.0
307510,456255,0,F,N,157500.0,Commercial associate,Higher education,House / apartment,46.0

In [93]:
df[158:162]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
158,100186,0,F,N,117000.0,Pensioner,Secondary / secondary special,House / apartment,60.0
159,100188,0,F,N,225000.0,Working,Higher education,Office apartment,42.0
160,100189,0,F,N,135000.0,Working,Incomplete higher,House / apartment,46.0
161,100190,0,M,Y,162000.0,Commercial associate,Higher education,House / apartment,38.0

In [94]:
df[493:496]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
493,100570,0,F,Y,180000.0,Commercial associate,Secondary / secondary special,House / apartment,36.0
494,100571,0,M,Y,292500.0,Working,Secondary / secondary special,House / apartment,27.0
495,100572,0,F,N,31500.0,Pensioner,Lower secondary,House / apartment,52.0

In [95]:
df[2140:2143]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
2140,102514,0,F,N,112500.0,Working,Secondary / secondary special,House / apartment,33.0
2141,102515,0,F,Y,130500.0,State servant,Academic degree,House / apartment,40.0
2142,102516,0,F,N,121500.0,Pensioner,Secondary / secondary special,House / apartment,58.0

In [97]:
df[222:224]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
222,100259,0,M,Y,180000.0,Pensioner,Secondary / secondary special,House / apartment,57.0
223,100260,0,M,N,180000.0,Working,Higher education,Co-op apartment,28.0

In [111]:
df[493:496]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
493,100570,0,0,1,180000.0,1,4,1,36.0
494,100571,0,1,1,292500.0,7,4,1,27.0
495,100572,0,0,0,31500.0,3,3,1,52.0

In [100]:
df['NAME_HOUSING_TYPE'].unique()

array(['House / apartment', 'Rented apartment', 'With parents',
       'Municipal apartment', 'Office apartment', 'Co-op apartment'],
      dtype=object)

In [101]:
for col_name in df.columns:
    if(df[col_name].dtype == 'object'):
        df[col_name]= df[col_name].astype('category')
        df[col_name] = df[col_name].cat.codes

In [112]:
df[158:162]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
158,100186,0,0,0,117000.0,3,4,1,60.0
159,100188,0,0,0,225000.0,7,1,3,42.0
160,100189,0,0,0,135000.0,7,2,1,46.0
161,100190,0,1,1,162000.0,1,1,1,38.0

In [14]:
y=df.loc[:,df.columns=='TARGET']
X=df.loc[:,['CODE_GENDER','FLAG_OWN_CAR','AMT_INCOME_TOTAL','NAME_INCOME_TYPE','NAME_EDUCATION_TYPE','NAME_HOUSING_TYPE','age']]

In [15]:
from imblearn.over_sampling import SMOTE

In [16]:
os = SMOTE(random_state=0)
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=0)
columns = X_train.columns

In [14]:
# y_train.info()

In [17]:
os_data_X,os_data_y=os.fit_sample(X_train, y_train)
os_data_X = pd.DataFrame(data=os_data_X,columns=columns )
os_data_y= pd.DataFrame(data=os_data_y,columns=['TARGET'])
# we can Check the numbers of our data
print("length of oversampled data is ",len(os_data_X))
print("NUMBER OF GOOD LOANS",len(os_data_y[os_data_y['TARGET']==0]))
print("NUMBER OF DEFAULTS",len(os_data_y[os_data_y['TARGET']==1]))
print("Proportion of GOOD LOANS data in oversampled data is ",len(os_data_y[os_data_y['TARGET']==0])/len(os_data_X))
print("Proportion of DEFAULTS data in oversampled data is ",len(os_data_y[os_data_y['TARGET']==1])/len(os_data_X))

length of oversampled data is  395724
NUMBER OF GOOD LOANS 197862
NUMBER OF DEFAULTS 197862
Proportion of GOOD LOANS data in oversampled data is  0.5
Proportion of DEFAULTS data in oversampled data is  0.5

In [18]:
from sklearn.linear_model import LogisticRegression

In [19]:
logreg = LogisticRegression()

In [20]:
logreg.fit(os_data_X[: 250000], os_data_y.values.ravel()[:250000])

LogisticRegression()

In [21]:
# y_pred = logreg.predict(os_data_X[250000:])
# print('Accuracy of logistic regression classifier on test set: {:.2f}'.format(logreg.score(X_test, y_test)))

In [23]:
len(y_test)

92253

In [24]:
# from sklearn.metrics import confusion_matrix
# confusion_matrix = confusion_matrix(y_test[250000:], y_pred)
# print(confusion_matrix)

In [25]:
import statsmodels.api as sm
logit_model=sm.Logit(os_data_y, os_data_X,)
result=logit_model.fit()
result.summary2()

Optimization terminated successfully.
         Current function value: 0.660297
         Iterations 5

<class 'statsmodels.iolib.summary2.Summary'>
"""
                           Results: Logit
=====================================================================
Model:               Logit             Pseudo R-squared:  0.047
Dependent Variable:  TARGET            AIC:               522604.7384
Date:                2020-09-28 21:55  BIC:               522680.9577
No. Observations:    395724            Log-Likelihood:    -2.6130e+05
Df Model:            6                 LL-Null:           -2.7429e+05
Df Residuals:        395717            LLR p-value:       0.0000
Converged:           1.0000            Scale:             1.0000
No. Iterations:      5.0000
---------------------------------------------------------------------
                     Coef.  Std.Err.     z     P>|z|   [0.025  0.975]
---------------------------------------------------------------------
CODE_GENDER          0.0589   0.0077    7.6906 0.0000  0.0439  0.0740
FLAG_OWN_CAR        -0.8524   0.0081 -104.7227 0.0000 -0.8683 -0.8364
AMT_INCOME_TOTAL     0.0000   0.0000   26.4467 0.0000  0.0000  0.0000
NAME_INCOME_TYPE     0.0589   0.0012   48.5526 0.0000  0.0565  0.0612
NAME_EDUCATION_TYPE  0.2144   0.0026   82.4392 0.0000  0.2093  0.2195
NAME_HOUSING_TYPE   -0.0047   0.0032   -1.4543 0.1459 -0.0110  0.0016
age                 -0.0223   0.0002 -102.0794 0.0000 -0.0228 -0.0219
=====================================================================

"""

In [26]:
result.pred_table()

array([[120670.,  77192.],
       [ 80603., 117259.]])

In [28]:
y_pred=result.predict(X_test)

In [29]:
y_pred

289126    0.553278
188491    0.578500
181177    0.449067
247950    0.522569
231639    0.607324
            ...
287907    0.410943
125584    0.512295
51502     0.288933
276439    0.615005
115235    0.500252
Length: 92253, dtype: float64

In [30]:
y_prediction_test = np.round(y_pred)
y_prediction_test

289126    1.0
188491    1.0
181177    0.0
247950    1.0
231639    1.0
         ...
287907    0.0
125584    1.0
51502     0.0
276439    1.0
115235    1.0
Length: 92253, dtype: float64

In [31]:
y_test['TARGET']

289126    0
188491    0
181177    0
247950    0
231639    0
         ..
287907    0
125584    0
51502     0
276439    0
115235    0
Name: TARGET, Length: 92253, dtype: int64

In [32]:
accuracy_score(y_test['TARGET'], y_prediction_test).round(2)

0.6

In [127]:
Xnew = [[1,0,150000,7,3,5,30]]

In [128]:
X_train.head(1)

,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
113008,1,1,202500.0,7,1,1,60.0

In [129]:
ynew = logreg.predict_proba(Xnew)
ynew.round(2)

array([[0.72, 0.28]])

In [130]:
Xnew1=[[1,1,300000,1,0,1,60]]

In [131]:
ynew1 = logreg.predict_proba(Xnew1)
ynew1.round(2)

array([[0.87, 0.13]])

In [57]:
ynew1[0]

array([0.83436389, 0.16563611])

In [59]:
ynew1[0][0]

0.8343638887354852

In [60]:
round(ynew1[0][0])

1.0